In [1]:
# import dependencies
from api_keys import alpha_vantage_api_key
import pprint as pp
import pandas as pd
from datetime import datetime
import requests
import matplotlib.pyplot as plt

## Get API data and put it in json

In [2]:
# declare codes of tickers used for the manufacturers
codes = ["AAPL", "MSI", "GOOG", "GOOGL"]
manufacturers = ["apple", "motorola", "google_class_c", "google_class_a"]


# declare dates and net incomes
dates = []
net_incomes = []

# create dataframe dictionary
dfs = {}

# initialize counter
counter = 0

# main for loop that loops through the ticker codes
for code in codes:
    # get jsons
    url = f'https://www.alphavantage.co/query?function=INCOME_STATEMENT&symbol={code}&outputsize=full&apikey={alpha_vantage_api_key}'
    response = requests.get(url)
    data_json = response.json()
    
    # try to add the net incomes to the net income list. Also add current date
    try:
        for quarter in data_json["quarterlyReports"]:
            net_incomes.append(int(quarter["netIncome"]))
            current_date_str = quarter["fiscalDateEnding"]
            current_date = datetime.strptime(current_date_str,'%Y-%m-%d')
            dates.append(current_date_str)
    except:
        pass
    
    # make a data dictionary from the data
    data_dict = {
        "Date" : dates,
        "Net Income" : net_incomes
    }
    
    # make a dataframe out of the dicitonary
    data_df = pd.DataFrame(data_dict)
    
    # assign each dataframe as a value in a dataframe dictionary
    dfs[f"{manufacturers[counter]}_df"] = data_df
    
    # clear all the lists so that they can be used in the next iteration of loop
    dates.clear()
    net_incomes.clear()
    
    # increment counter
    counter = counter + 1

In [3]:
# output apple dataframe to a csv
apple_df = dfs["apple_df"]
apple_df.to_csv("resources/apple_net_income.csv")
apple_df

          Date   Net Income
0   2023-03-31  24160000000
1   2022-12-31  29998000000
2   2022-09-30  20721000000
3   2022-06-30  19442000000
4   2022-03-31  25010000000
5   2021-12-31  34630000000
6   2021-09-30  20551000000
7   2021-06-30  21744000000
8   2021-03-31  23630000000
9   2020-12-31  28755000000
10  2020-09-30  12673000000
11  2020-06-30  11253000000
12  2020-03-31  11249000000
13  2019-12-31  22236000000
14  2019-09-30  13686000000
15  2019-06-30  10044000000
16  2019-03-31  11561000000
17  2018-12-31  19965000000
18  2018-09-30  14125000000
19  2018-06-30  11519000000

In [4]:
# output motorola dataframe to a csv
motorola_df = dfs["motorola_df"]
motorola_df.to_csv('resources/motorola_net_income.csv')
motorola_df

          Date  Net Income
0   2023-03-31   278000000
1   2022-12-31   589000000
2   2022-09-30   279000000
3   2022-06-30   228000000
4   2022-03-31   267000000
5   2021-12-31   401000000
6   2021-09-30   307000000
7   2021-06-30   293000000
8   2021-03-31   244000000
9   2020-12-31   412000000
10  2020-09-30   205000000
11  2020-06-30   135000000
12  2020-03-31   197000000
13  2019-12-31   244000000
14  2019-09-30   267000000
15  2019-06-30   207000000
16  2019-03-31   151000000
17  2018-12-31   423000000
18  2018-09-30   247000000
19  2018-06-30   180000000

In [5]:
# output google class c dataframe to a csv
google_class_c_df = dfs["google_class_c_df"]
google_class_c_df.to_csv("resources/google_class_c_net_income.csv")
google_class_c_df

          Date   Net Income
0   2023-03-31  15051000000
1   2022-12-31  13624000000
2   2022-09-30  13910000000
3   2022-06-30  16002000000
4   2022-03-31  16436000000
5   2021-12-31  20642000000
6   2021-09-30  18936000000
7   2021-06-30  18525000000
8   2021-03-31  17930000000
9   2020-12-31  15227000000
10  2020-09-30  11247000000
11  2020-06-30   6959000000
12  2020-03-31   6836000000
13  2019-12-31  10671000000
14  2019-09-30   7068000000
15  2019-06-30   9947000000
16  2019-03-31   6657000000
17  2018-12-31   8948000000
18  2018-09-30   9192000000
19  2018-06-30   3195000000

In [6]:
# output google class a dataframe to a csv
google_class_a_df = dfs["google_class_a_df"]
google_class_a_df.to_csv("resources/google_class_a_net_income.csv")
google_class_a_df

          Date   Net Income
0   2023-03-31  15051000000
1   2022-12-31  13624000000
2   2022-09-30  13910000000
3   2022-06-30  16002000000
4   2022-03-31  16436000000
5   2021-12-31  20642000000
6   2021-09-30  18936000000
7   2021-06-30  18525000000
8   2021-03-31  17930000000
9   2020-12-31  15227000000
10  2020-09-30  11247000000
11  2020-06-30   6959000000
12  2020-03-31   6836000000
13  2019-12-31  10671000000
14  2019-09-30   7068000000
15  2019-06-30   9947000000
16  2019-03-31   6657000000
17  2018-12-31   8948000000
18  2018-09-30   9192000000
19  2018-06-30   3195000000